print ("1  羽绒服  253.6  500  10")
print ("2  牛仔裤  86.3  600  60")
print ("3  风衣  96.8  335  43")
print ("4  皮草  135.9  855  63")
print ("5  T桖  65.8  632  63")
print ("6  衬衫  49.3  562  120")
print ("7  牛仔裤  86.3  600  60")
print ("8  羽绒服  253.6  500  10")
print ("9  牛仔裤  86.3  600  35")
print ("10  羽绒服  253.6  500  140")
print ("11  牛仔裤  86.3  600  90")
print ("12  皮草  135.9  855  24")
print ("13  T桖  65.8  632  45")
print ("14  风衣  96.8  335  25")
print ("15  牛仔裤  86.3  600  60")
print ("16  T桖  65.8  632  129")
print ("17  羽绒服  253.6  500  10")
print ("18  风衣  96.8  335  43")
print ("19  T桖  65.8  632  63")
print ("20  牛仔裤  86.3  600  60")
print ("21  皮草  135.9  855  63")
print ("22  风衣  96.8  335  60")
print ("23  T桖  65.8  632  58")
print ("24  牛仔裤  86.3  600  140")
print ("25  T桖  65.8  632  48")
print ("26  风衣  96.8  335  43")
print ("27  皮草  135.9  855  57")
print ("28  羽绒服  253.6  500  10")
print ("29  T桖  65.8  632  63")
print ("30  风衣  96.8  335  78")

T=(63+45+129+63+58+48+63)#T血总数量，单价65.8
C=(120)#衬衫销售总量，单价49.3
F=(43+25+43+60+43+78)  #风衣销售总量，单价96.8
N=(60+72+90+60+60+140+35)#牛仔裤销售总量，单价86.3
P=(63+24+63+57)#皮草销售总量，单价135.9
Y=(10+69+140+10+10)#羽绒服销售总量，单价253.6

#12月份总销售额
sum=(T*65.8+C*49.3+F*96.8+N*86.3+P*135.9+Y*253.6)
print("12月总销售额是：",sum)

print((T+C+F+N+P+Y)/30)

print("T桖：{:.0%}".format(T/(T+C+F+N+P+Y)))
print("风衣：{:.0%}".format(F/(T+C+F+N+P+Y)))
print("羽绒服：{:.0%}".format(Y/(T+C+F+N+P+Y)))
print("皮草：{:.0%}".format(P/(T+C+F+N+P+Y)))
print("衬衫：{:.0%}".format(C/(T+C+F+N+P+Y)))
print("牛仔裤：{:.0%}".format(N/(T+C+F+N+P+Y)))
